____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_2 (InputLayer)             (None, None, None, 1) 0                                            
____________________________________________________________________________________________________
conv_1 (Conv2D)                  (None, None, None, 48 480         input_2[0][0]                    
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, None, None, 48 192         conv_1[0][0]                     
____________________________________________________________________________________________________
activation_5 (Activation)        (None, None, None, 48 0           batch_normalization_5[0][0]      
____________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)   (None, None, None, 48 0           activation_5[0][0]               
____________________________________________________________________________________________________
conv_2 (Conv2D)                  (None, None, None, 64 27712       max_pooling2d_4[0][0]            
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, None, None, 64 256         conv_2[0][0]                     
____________________________________________________________________________________________________
activation_6 (Activation)        (None, None, None, 64 0           batch_normalization_6[0][0]      
____________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)   (None, None, None, 64 0           activation_6[0][0]               
____________________________________________________________________________________________________
conv_3 (Conv2D)                  (None, None, None, 12 73856       max_pooling2d_5[0][0]            
____________________________________________________________________________________________________
batch_normalization_7 (BatchNorm (None, None, None, 12 512         conv_3[0][0]                     
____________________________________________________________________________________________________
activation_7 (Activation)        (None, None, None, 12 0           batch_normalization_7[0][0]      
____________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)   (None, None, None, 12 0           activation_7[0][0]               
____________________________________________________________________________________________________
conv_4 (Conv2D)                  (None, None, None, 25 295168      max_pooling2d_6[0][0]            
____________________________________________________________________________________________________
batch_normalization_8 (BatchNorm (None, None, None, 25 1024        conv_4[0][0]                     
____________________________________________________________________________________________________
activation_8 (Activation)        (None, None, None, 25 0           batch_normalization_8[0][0]      
____________________________________________________________________________________________________
conv_fc_1 (Conv2D)               (None, None, None, 20 134219776   activation_8[0][0]               
____________________________________________________________________________________________________
conv_presence_indicator (Conv2D) (None, None, None, 1) 2049        conv_fc_1[0][0]                  
____________________________________________________________________________________________________
conv_encoded_chars (Conv2D)      (None, None, None, 28 590112      conv_fc_1[0][0]                  
====================================================================================================
Total params: 135,211,137
Trainable params: 135,210,145
Non-trainable params: 992
____________________________________________________________________________________________________
