____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_2 (InputLayer)             (None, None, None, 1) 0                                            
____________________________________________________________________________________________________
conv_1 (Conv2D)                  (None, None, None, 48 1248        input_2[0][0]                    
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, None, None, 48 192         conv_1[0][0]                     
____________________________________________________________________________________________________
activation_4 (Activation)        (None, None, None, 48 0           batch_normalization_4[0][0]      
____________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)   (None, None, None, 48 0           activation_4[0][0]               
____________________________________________________________________________________________________
conv_2 (Conv2D)                  (None, None, None, 64 76864       max_pooling2d_4[0][0]            
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, None, None, 64 256         conv_2[0][0]                     
____________________________________________________________________________________________________
activation_5 (Activation)        (None, None, None, 64 0           batch_normalization_5[0][0]      
____________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)   (None, None, None, 64 0           activation_5[0][0]               
____________________________________________________________________________________________________
conv_3 (Conv2D)                  (None, None, None, 12 204928      max_pooling2d_5[0][0]            
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, None, None, 12 512         conv_3[0][0]                     
____________________________________________________________________________________________________
activation_6 (Activation)        (None, None, None, 12 0           batch_normalization_6[0][0]      
____________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)   (None, None, None, 12 0           activation_6[0][0]               
____________________________________________________________________________________________________
conv_fc_1 (Conv2D)               (None, None, None, 20 67110912    max_pooling2d_6[0][0]            
____________________________________________________________________________________________________
conv_presence_idicator (Conv2D)  (None, None, None, 1) 2049        conv_fc_1[0][0]                  
____________________________________________________________________________________________________
conv_encoded_chars (Conv2D)      (None, None, None, 28 590112      conv_fc_1[0][0]                  
====================================================================================================
Total params: 67,987,073
Trainable params: 67,986,593
Non-trainable params: 480
____________________________________________________________________________________________________
