____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 64, 128, 1)    0                                            
____________________________________________________________________________________________________
conv_1 (Conv2D)                  (None, 64, 128, 48)   2400        input_1[0][0]                    
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 64, 128, 48)   0           conv_1[0][0]                     
____________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)   (None, 32, 64, 48)    0           activation_1[0][0]               
____________________________________________________________________________________________________
conv_2 (Conv2D)                  (None, 32, 64, 64)    76864       max_pooling2d_1[0][0]            
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 32, 64, 64)    0           conv_2[0][0]                     
____________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)   (None, 16, 64, 64)    0           activation_2[0][0]               
____________________________________________________________________________________________________
conv_3 (Conv2D)                  (None, 16, 64, 128)   204928      max_pooling2d_2[0][0]            
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 16, 64, 128)   0           conv_3[0][0]                     
____________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)   (None, 8, 32, 128)    0           activation_3[0][0]               
____________________________________________________________________________________________________
conv_4 (Conv2D)                  (None, 8, 32, 256)    295168      max_pooling2d_3[0][0]            
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 8, 32, 256)    0           conv_4[0][0]                     
____________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)   (None, 4, 16, 256)    0           activation_4[0][0]               
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 16384)         0           max_pooling2d_4[0][0]            
____________________________________________________________________________________________________
fc_1 (Dense)                     (None, 2048)          33556480    flatten_1[0][0]                  
____________________________________________________________________________________________________
presence_indicator (Dense)       (None, 1)             2049        fc_1[0][0]                       
____________________________________________________________________________________________________
char_1 (Dense)                   (None, 36)            73764       fc_1[0][0]                       
____________________________________________________________________________________________________
char_2 (Dense)                   (None, 36)            73764       fc_1[0][0]                       
____________________________________________________________________________________________________
char_3 (Dense)                   (None, 36)            73764       fc_1[0][0]                       
____________________________________________________________________________________________________
char_4 (Dense)                   (None, 36)            73764       fc_1[0][0]                       
____________________________________________________________________________________________________
char_5 (Dense)                   (None, 36)            73764       fc_1[0][0]                       
____________________________________________________________________________________________________
char_6 (Dense)                   (None, 36)            73764       fc_1[0][0]                       
____________________________________________________________________________________________________
char_7 (Dense)                   (None, 36)            73764       fc_1[0][0]                       
____________________________________________________________________________________________________
char_8 (Dense)                   (None, 36)            73764       fc_1[0][0]                       
====================================================================================================
Total params: 34,728,001
Trainable params: 34,728,001
Non-trainable params: 0
____________________________________________________________________________________________________
