____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 64, 128, 1)    0                                            
____________________________________________________________________________________________________
block1_conv1 (Conv2D)            (None, 64, 128, 64)   640         input_1[0][0]                    
____________________________________________________________________________________________________
block1_conv2 (Conv2D)            (None, 64, 128, 64)   36928       block1_conv1[0][0]               
____________________________________________________________________________________________________
block1_pool (MaxPooling2D)       (None, 32, 64, 64)    0           block1_conv2[0][0]               
____________________________________________________________________________________________________
block2_conv1 (Conv2D)            (None, 32, 64, 128)   73856       block1_pool[0][0]                
____________________________________________________________________________________________________
block2_conv2 (Conv2D)            (None, 32, 64, 128)   147584      block2_conv1[0][0]               
____________________________________________________________________________________________________
block2_pool (MaxPooling2D)       (None, 16, 32, 128)   0           block2_conv2[0][0]               
____________________________________________________________________________________________________
block3_conv1 (Conv2D)            (None, 16, 32, 256)   295168      block2_pool[0][0]                
____________________________________________________________________________________________________
block3_conv2 (Conv2D)            (None, 16, 32, 256)   590080      block3_conv1[0][0]               
____________________________________________________________________________________________________
block3_conv3 (Conv2D)            (None, 16, 32, 256)   590080      block3_conv2[0][0]               
____________________________________________________________________________________________________
block3_pool (MaxPooling2D)       (None, 8, 16, 256)    0           block3_conv3[0][0]               
____________________________________________________________________________________________________
block4_conv1 (Conv2D)            (None, 8, 16, 512)    1180160     block3_pool[0][0]                
____________________________________________________________________________________________________
block4_conv2 (Conv2D)            (None, 8, 16, 512)    2359808     block4_conv1[0][0]               
____________________________________________________________________________________________________
block4_conv3 (Conv2D)            (None, 8, 16, 512)    2359808     block4_conv2[0][0]               
____________________________________________________________________________________________________
block4_conv4 (Conv2D)            (None, 8, 16, 512)    2359808     block4_conv3[0][0]               
____________________________________________________________________________________________________
block4_pool (MaxPooling2D)       (None, 4, 8, 512)     0           block4_conv4[0][0]               
____________________________________________________________________________________________________
flatten (Flatten)                (None, 16384)         0           block4_pool[0][0]                
____________________________________________________________________________________________________
fc1 (Dense)                      (None, 4096)          67112960    flatten[0][0]                    
____________________________________________________________________________________________________
presence_indicator (Dense)       (None, 1)             4097        fc1[0][0]                        
____________________________________________________________________________________________________
encoded_chars (Dense)            (None, 288)           1179936     fc1[0][0]                        
====================================================================================================
Total params: 78,290,913
Trainable params: 78,290,913
Non-trainable params: 0
____________________________________________________________________________________________________
