____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 64, 128, 1)    0                                            
____________________________________________________________________________________________________
conv_1 (Conv2D)                  (None, 64, 128, 48)   480         input_1[0][0]                    
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 64, 128, 48)   192         conv_1[0][0]                     
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 64, 128, 48)   0           batch_normalization_1[0][0]      
____________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)   (None, 32, 64, 48)    0           activation_1[0][0]               
____________________________________________________________________________________________________
conv_2 (Conv2D)                  (None, 32, 64, 64)    27712       max_pooling2d_1[0][0]            
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 32, 64, 64)    256         conv_2[0][0]                     
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 32, 64, 64)    0           batch_normalization_2[0][0]      
____________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)   (None, 16, 32, 64)    0           activation_2[0][0]               
____________________________________________________________________________________________________
conv_3 (Conv2D)                  (None, 16, 32, 128)   73856       max_pooling2d_2[0][0]            
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 16, 32, 128)   512         conv_3[0][0]                     
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 16, 32, 128)   0           batch_normalization_3[0][0]      
____________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)   (None, 8, 16, 128)    0           activation_3[0][0]               
____________________________________________________________________________________________________
conv_4 (Conv2D)                  (None, 8, 16, 256)    295168      max_pooling2d_3[0][0]            
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, 8, 16, 256)    1024        conv_4[0][0]                     
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 8, 16, 256)    0           batch_normalization_4[0][0]      
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 32768)         0           activation_4[0][0]               
____________________________________________________________________________________________________
fc_1 (Dense)                     (None, 2048)          67110912    flatten_1[0][0]                  
____________________________________________________________________________________________________
presence_indicator (Dense)       (None, 1)             2049        fc_1[0][0]                       
____________________________________________________________________________________________________
encoded_chars (Dense)            (None, 288)           590112      fc_1[0][0]                       
====================================================================================================
Total params: 68,102,273
Trainable params: 68,101,281
Non-trainable params: 992
____________________________________________________________________________________________________
